v13/reactor/reactorFluid_v1/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// thermoType
// {
//     type            heRhoThermo;
//     mixture         pureMixture;
//     transport       const;
//     thermo          hConst;
//     equationOfState perfectGas;
//     specie          specie;
//     energy          sensibleEnthalpy; //sensibleInternalEnergy; //sensibleEnthalpy;
// }

// pRef            101325;

// mixture
// {
//     specie
//     {
//         molWeight       28.9;
//     }
//     thermodynamics
//     {
//         Cp              1000;       // [J/(kg K)]
//         hf              0;
//     }
//     transport
//     {
//         mu              1.8e-05; //4.5e-05;
//         Pr              0.7; //0.9
//     }
// }

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   28.9;
    }
    thermodynamics
    {
        Cp          1007;
        Hf          0;
    }
    transport
    {
        As          1.4792e-06;
        Ts          116;
    }
}

// ************************************************************************* //
