v13/reactor/reactorFluid_v1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;      // Laminar → ν_t = 0
    }
   
    outlet
    {
        type            inletOutlet;    // Or zeroGradient
        inletValue      uniform 0;
        value           uniform 0;
    }
 
    pipe
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}

// internalField   uniform 0;

// boundaryField
// {
//     pipe
//     {
//         type            nutkWallFunction;
//         value           uniform 0;
//     }

//     inlet
//     {
//         type            calculated;
//         value           uniform 0;
//     }

//     outlet
//     {
//         type            calculated;
//         value           uniform 0;
//     }
// }

// ************************************************************************* //
