v13/reactor/reactorFluid_v1/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


minmaxdomain_scalar
{
    type            volFieldValue;
    libs            ( "libfieldFunctionObjects.so" );

    enabled 	    true; 	//true or false
    log             true;	//write to screen

    writeControl    writeTime;
    // writeControl    timeStep;
    // writeInterval   1;

    writeFields     false;	//write solution to field value - Not needed when only reporting value to screen

    writeLocation   true;	//write location in the output file

    select          all;
    mode            none;
    operation       none;

    fields
    (
        T
    );
}

minmaxdomain_vector
{
    type            volFieldValue;
    libs            ( "libfieldFunctionObjects.so" );

    enabled 	    true; 	//true or false
    log             true;	//write to screen
    
    writeControl    writeTime;
    // writeControl    timeStep;
    // writeInterval   1;

    writeFields     false;	//write solution to field value - Not needed when only reporting value to screen

    writeLocation   true;	//write location in the output file

    select          all;
    mode            none;
    operation       none;

    fields
    (
        U
    );
}

mindomain_scalar
{
    $minmaxdomain_scalar
    operation       min;
}

mindomain_vector
{
    $minmaxdomain_vector
    mode        magnitude;
    operation       minMag;
}

maxdomain_scalar
{
    $minmaxdomain_scalar
    operation       max;
}

maxdomain_vector
{
    $minmaxdomain_vector
    mode        magnitude;
    operation       maxMag;
}

inletFlux
{
    type            surfaceFieldValue;
    libs            ( "libfieldFunctionObjects.so" );
    writeControl    writeTime;
    log             true;

    writeFields     false;
    select          patch;
    name            inlet;
    operation       sum;

    enabled 	    true; 	//true or false

    fields
    (
        phi
    );
}

outletFlux
{
    $inletFlux;
    name            outlet;
}

wallFlux
{
    $inletFlux;
    name            pipe;
}

fieldAverage1
{
    type                fieldAverage;
    libs                ("libfieldFunctionObjects.so");

    writeControl        writeTime;

    restartOnRestart    false;
    restartOnOutput     false;
    periodicRestart     false;
    restartPeriod       0.002;

    base                time;
    window              10.0;
    windowName          w1;

    mean                yes;
    prime2Mean          yes;

    fields              (U p T);
}

// ************************************************************************* //
